// import { numArrayCreator } from "./utilities/numArrayCreator";
// export const defermentList = numArrayCreator(0,31);
export const doctors = [
  { name: "Особистий лікар", value: "" },
  { name: "Брик Л.М.", value: "Брик Л.М." },
  { name: "Корицький В.Г.", value: "Корицький В.Г." },
  { name: "Куц О.В.", value: "Куц О.В." },
  { name: "Кучмій В.Я.", value: "Кучмій В.Я." },
  { name: "Лучанко В.І.", value: "Лучанко В.І." },
  { name: "Омеляш В.І.", value: "Омеляш В.І." },
  { name: "Панченко В.А.", value: "Панченко В.А." },
  { name: "Питляр О.В.", value: "Питляр О.В." },
  { name: "Піх І.І.", value: "Піх І.І." },
  { name: "Шмигельська М.Б.", value: "Шмигельська М.Б." },
  { name: "Яшан О.І.", value: "Яшан О.І." },
  { name: "Дзіх О.І.", value: "Дзіх О.І." }
];
const diagnosisMaxilloSurgeryList = [
  {
    name: "Періодонтит",
    code: "K04.4",
    codeIcpc: "D82",
    codeAkmi: "97322-0X - постійні, 97311-0X - постійні, Х - кількість зубів"
  },
  { name: "Періостит", code: "K10.2", codeIcpc: "D82", codeAkmi: "96215-00" },
  {
    name: "Періодонтит",
    code: "K04.4",
    codeIcpc: "D82",
    codeAkmi: "97322-0X - постійні, 97311-0X - постійні, Х - кількість зубів"
  },
  {
    name: "Підщелепний абсцес",
    code: "K12.2",
    codeIcpc: "D83",
    codeAkmi: "K12.2"
  },
  {
    name: "Абсцес шкіри",
    code: "L02.0",
    codeIcpc: "S10",
    codeAkmi: "30223-01"
  },
  {
    name: "Вивих зуба",
    code: "S03.2",
    codeIcpc: "D80",
    codeAkmi:
      "97311-0Х - Х - кількість зубів; 97387-00 - реплантація; 97386-01 - шинування"
  },
  { name: "Фурункул", code: "L02.0", codeIcpc: "S10", codeAkmi: "30223-01" },
  { name: "Гострий лімфаденіт", code: "L04.0", codeIcpc: "B70", codeAkmi: "" },
  { name: "Стоматит", code: "K12.1", codeIcpc: "D83", codeAkmi: "" },
  { name: "Сіалоаденіт", code: "K11.2", codeIcpc: "D83", codeAkmi: "" },
  {
    name: "Рана брови",
    code: "S01.1",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана повіки",
    code: "S01.1",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана підочної ділянки",
    code: "S01.42",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана губи",
    code: "S01.51",
    codeIcpc: "D80",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30052-00 - ушивання"
  },
  {
    name: "Рана щоки(шкіра)",
    code: "S01.41",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана язика",
    code: "S01.52",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана іншої ділянки",
    code: "S01.49",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Множинні рани рота",
    code: "S01.59",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Множинні рани шкіри",
    code: "S01.49",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана щоки(слизова)",
    code: "S01.52",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана підборіддя",
    code: "S01.88",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Рана лоба",
    code: "S01.88",
    codeIcpc: "S18",
    codeAkmi: "90665-00 - з висіченням; 90686-01 - без; 30032-00 - ушивання"
  },
  {
    name: "Забій чи садна обличчя",
    code: "S00.8",
    codeIcpc: "S16",
    codeAkmi: ""
  },
  {
    name: "П-м н/щ(гілки)",
    code: "S02.64",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  {
    name: "П-м н/щ(кута)",
    code: "S02.65",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  {
    name: "П-м н/щ(суглобового)",
    code: "S02.61",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  {
    name: "П-м н/щ(тіла)",
    code: "S02.68",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  {
    name: "П-м н/щ(множинний)",
    code: "S02.69",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  {
    name: "П-м в/щ",
    code: "S02.4",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  {
    name: "Множинні п-ми кісток черепа",
    code: "S02.7",
    codeIcpc: "L76",
    codeAkmi: "47756-00 - шинування; 47777-репозиція"
  },
  { name: "Вивих щелепи", code: "S03.0", codeIcpc: "L76", codeAkmi: "" },
  { name: "Атерома", code: "L72.1", codeIcpc: "S93", codeAkmi: "30071-00" },
  { name: "Епуліс", code: "K06.8", codeIcpc: "D82", codeAkmi: "30023-00" },
  {
    name: "Радикулярна кіста",
    code: "K04.8",
    codeIcpc: "D82",
    codeAkmi: "37008-01"
  },
  {
    name: "Фолікулярна кіста",
    code: "K09.0",
    codeIcpc: "D82",
    codeAkmi: "37008-01"
  },
  {
    name: "Ретенційна кіста",
    code: "K11.6",
    codeIcpc: "D83",
    codeAkmi: "30283-00"
  },
  {
    name: "Надкомплектні зуби",
    code: "K00.1",
    codeIcpc: "D82",
    codeAkmi: "97322-0Х, де Х-к-сть зубів"
  },
  {
    name: "Ретеновані зуби",
    code: "K01.0",
    codeIcpc: "D82",
    codeAkmi: "97322-0Х, де Х-к-сть зубів"
  },
  {
    name: "Коротка вуздечка язика",
    code: "Q38.1",
    codeIcpc: "D81",
    codeAkmi: "30278-02"
  },
  {
    name: "Серединна кіста шиї",
    code: "Q18.0",
    codeIcpc: "D81",
    codeAkmi: "30286-00"
  },
  {
    name: "Постекстракційна кровотеча",
    code: "T81.0",
    codeIcpc: "A80",
    codeAkmi: "97399-00"
  }
];
const diagnosisOtolaryngologyList = [
  {
    name: "Закритий перелом кісток носа",
    codeIcpc: "L76",
    code: "S02.2",
    codeAkmi: "47738-00 - репозиція, 57921-00 - Rg"
  },
  { name: "Аденоїди", codeIcpc: "R90", code: "J35.2", codeAkmi: "41801-00" },
  {
    name: "Аденоїди+мигдалики",
    codeIcpc: "R90",
    code: "J35.3",
    codeAkmi: "41789-01"
  },
  {
    name: "Фурункул присінку носа",
    codeIcpc: "R73",
    code: "J34.0",
    codeAkmi: "30223-01"
  },
  {
    name: "Хронічний декомпенс. тонзиліт",
    codeIcpc: "R90",
    code: "J35.0",
    codeAkmi: "41798-00"
  },
  {
    name: "Паратонзилярний абсцес",
    codeIcpc: "R76",
    code: "J36.0",
    codeAkmi: "41807-00"
  },
  {
    name: "Травм. перф. барабанної перетинки",
    codeIcpc: "H77",
    code: "H72.0",
    codeAkmi: "41530-00"
  },
  {
    name: "Викривлення переділки носа",
    codeIcpc: "R99",
    code: "J34.2",
    codeAkmi: "41671-00"
  },
  {
    name: "Гострий гнійний середній отит",
    codeIcpc: "H71",
    code: "H66.0",
    codeAkmi: "41626-01"
  },
  {
    name: "Антрохоанальний поліп",
    codeIcpc: "R99",
    code: "J33.8",
    codeAkmi:
      "41716-03 – видалення поліпу41716-04 – інші втручання на в/щ пазусі"
  }
  // { name: "", codeIcpc: "", code: "", codeAkmi: "" },
];
export const childTypeList = [
  {
    name: "Форма навчання",
    childType1: "",
    childType2: ""
  },
  {
    name: "дошкільнятко",
    childType1: "дитини, яка відвідує дошкільний навчальний заклад",
    childType2: "дитині, яка відвідує дошкільний навчальний заклад"
  },
  {
    name: "учень",
    childType1: "дитини, яка відвідує загальноосвітній навчальний заклад",
    childType2: "учню"
  },
  {
    name: "студент",
    childType1: "студента навчального закладу I-IV рівнів акредитації",
    childType2: "студенту"
  }
];
export const maleNames = [
  "Аркадій",
  "Антон",
  "Артур",
  "Арсен",
  "Анатолій",
  "Семен",
  "Олег",
  "Василь",
  "Степан",
  "Михайло",
  "Мирон",
  "Мирослав",
  "Роман",
  "Тарас",
  "Святослав",
  "В'ячеслав",
  "Ярослав",
  "Володимир",
  "Петро",
  "Павло",
  "Гнат",
  "Борис",
  "Ростислав",
  "Станіслав",
  "Семен",
  "Тимур",
  "Лука",
  "Тимофій",
  "Тадей",
  "Пилип",
  "Адріан",
  "Андрій",
  "Валерій",
  "Едуард",
  "Віталій",
  "Віктор",
  "Григорій",
  "Максим",
  "Констянтин",
  "Ілля",
  "Любомир",
  "Руслан",
  "Рустам",
  "Назар",
  "Назарій",
  "Олексій",
  "Захар",
  "Олександр",
  "Іван",
  "Ігор",
  "Зіновій",
  "Артем",
  "Даніель",
  "Данило",
  "Артур",
  "Денис",
  "Владислав",
  "Вадим",
  "Юрій",
  "Владлен",
  "Матвій",
  "Устим",
  "Йосип",
  "Осип",
  "Орест",
  "Генадій",
  "Адам",
  "Кирило",
  "Гліб",
  "Богдан",
  "Євген",
  "Марк",
  "Марко",
  "Маркіян",
  "Адріян",
  "Олесь",
  "Сергій",
  "Альберт",
  "Валентин",
  "Влад",
  "Всеволод",
  "Георгій",
  "Гордій",
  "Дем'ян",
  "Давид",
  "Дмитро",
  "Єгор",
  "Зиновій",
  "Зорян",
  "Леонід",
  "Лев",
  "Мартин",
  "Мар'ян",
  "Нестор",
  "Омелян",
  "Остап",
  "Горден",
  "Северин",
  "Федір",
  "Юлій",
  "Юхим",
  "Юліан",
  "Ян",
  "Микола"
  // "",
];
const diagnosisFree = [
  { name: "Не вказувати діагноз", code: "", codeIcpc: "", codeAkmi: "" }
];
export const maxilloSortedList = diagnosisFree.concat(
  diagnosisMaxilloSurgeryList.sort(function (a, b) {
    return a.name.localeCompare(b.name);
  })
);
export const otoSortedList = diagnosisFree.concat(
  diagnosisOtolaryngologyList.sort(function (a, b) {
    return a.name.localeCompare(b.name);
  })
);
